---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Custom
source: html/7c507534-040c-44de-4b82-44db5b952821.htm
---
# Autodesk.Revit.DB.SpecTypeId.Custom Property

Unrecognized custom spec.

## Syntax (C#)
```csharp
public static ForgeTypeId Custom { get; }
```